In [1]:
import pandas as pd
import numpy as np

In [7]:
mi_lista = list(range(0,20))

In [8]:
mi_lista

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [13]:
serie_1 = pd.Series(mi_lista, dtype = float)
serie_1

0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
11    11.0
12    12.0
13    13.0
14    14.0
15    15.0
16    16.0
17    17.0
18    18.0
19    19.0
dtype: float64

In [14]:
mi_dic = {'Rodrigo' : 7, 'David': 8, 'Daniela' : 6, 'Ravi' : 10}

In [15]:
mi_dic

{'Rodrigo': 7, 'David': 8, 'Daniela': 6, 'Ravi': 10}

In [16]:
serie_2 = pd.Series(mi_dic)

In [21]:
serie_2

In [18]:
serie_2.index, serie_2[0]

(Index(['Rodrigo', 'David', 'Daniela', 'Ravi'], dtype='object'), 7)

In [28]:
serie_1.index, serie_1.size, serie_1.dtype

(RangeIndex(start=0, stop=20, step=1), 20, dtype('float64'))

In [31]:
serie_2['Ravi'], serie_2[['Daniela', 'Ravi']]

(10,
 Daniela     6
 Ravi       10
 dtype: int64)

In [32]:
serie_1[19]

19.0

In [37]:
serie_1.count(), serie_1.sum(), serie_1.value_counts()

(20,
 190.0,
 0.0     1
 1.0     1
 18.0    1
 17.0    1
 16.0    1
 15.0    1
 14.0    1
 13.0    1
 12.0    1
 11.0    1
 10.0    1
 9.0     1
 8.0     1
 7.0     1
 6.0     1
 5.0     1
 4.0     1
 3.0     1
 2.0     1
 19.0    1
 dtype: int64)

In [38]:
serie_2.min(), serie_2.max(), serie_2.std(), serie_2.mean()

(6, 10, 1.707825127659933, 7.75)

In [54]:
serie_3 = serie_2.apply(str)

In [59]:
serie_3.apply(int).apply(np.sqrt).apply(str)[0]

'2.6457513110645907'

In [63]:
mask = (serie_2 > 6) & (serie_2 < 9)
serie_2[mask].sum()

15

In [66]:
serie_4 = pd.Series([None, 4,3, None, 10 , 20 , None])

In [73]:
serie_4.dropna(inplace=True)

In [78]:
serie_4.reset_index(drop = True, inplace = True)

In [79]:
serie_4

0     4.0
1     3.0
2    10.0
3    20.0
dtype: float64

In [80]:
mi_dic_2 = {'Alumnos': ['Ravi', 'Daniel', 'Daniela', 'Justo', 'Mateo'], 'Notas' : [5, 10, 3 ,10, 7],
 'Edad': [25, 30, 24, 42, 50]}

In [81]:
mi_dic_2

{'Alumnos': ['Ravi', 'Daniel', 'Daniela', 'Justo', 'Mateo'],
 'Notas': [5, 10, 3, 10, 7],
 'Edad': [25, 30, 24, 42, 50]}

In [90]:
mi_dic_2['Alumnos']

['Ravi', 'Daniel', 'Daniela', 'Justo', 'Mateo']

In [102]:
df1 = pd.DataFrame(mi_dic_2, index = mi_dic_2['Alumnos']).drop('Alumnos', axis = 1)

In [103]:
df1.sort_values('Notas', inplace = True)

In [104]:
df1

         Notas  Edad
Daniela      3    24
Ravi         5    25
Mateo        7    50
Daniel      10    30
Justo       10    42

In [91]:
df1.columns

Index(['Notas', 'Edad'], dtype='object')

In [92]:
df1['Notas'][0] = 7

In [93]:
df1

         Notas  Edad
Ravi         7    25
Daniel      10    30
Daniela      3    24
Justo       10    42
Mateo        7    50

In [107]:
import os
os.getcwd()

'c:\\Users\\Pablo\\AppData\\Local\\Programs\\Microsoft VS Code'

In [2]:
df2 = pd.read_csv(r'C:\Users\Pablo\Documents\GitProjects\Henry\DS-M1\Clase 04\colesterol.csv', sep = ';', decimal = ',')

In [111]:
df2.head(10)

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [113]:
df2.tail(20)

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [114]:
df2.describe()

            edad        peso     altura  colesterol
count  14.000000   13.000000  14.000000   13.000000
mean   38.214286   70.923077   1.768571  220.230769
std    15.621379   16.126901   0.115016   39.847948
min    18.000000   51.000000   1.580000  148.000000
25%    24.750000   61.000000   1.705000  194.000000
50%    35.000000   65.000000   1.755000  210.000000
75%    49.750000   78.000000   1.840000  249.000000
max    68.000000  109.000000   1.980000  280.000000

In [5]:
df2['colesterol'].sum()

2863.0

In [8]:
df3 = pd.read_excel('jugadores.xlsx')

In [9]:
df3

   Jugador  Goles  Salario
0        9      4       51
1        2      3       28
2        1      3       53
3        7      0       84
4        3      3       59
5        4      3       65

In [10]:
df3.to_csv('jugadores_clase.csv', sep = ';')

In [12]:
df2.to_excel('colesterol.xlsx')

In [14]:
df2['peso'] = pd.Series([1,2])

In [16]:
del df2['peso']

In [28]:
df2.iloc[3,3]

1.7

In [29]:
df2.loc[3][3]

1.7

In [36]:
df2.sexo, df['sexo']

'HMHMMHHMHHMHHM'

In [42]:
df2.groupby(['edad']).sum()

      altura  colesterol
edad
18      1.79       182.0
20      1.77       194.0
22      1.66         0.0
24      1.81       191.0
27      1.98       210.0
32      1.73       232.0
35      3.64       441.0
46      3.43       428.0
51      1.72       276.0
53      1.62       262.0
58      1.87       198.0
68      1.74       249.0

AttributeError: 'DataFrame' object has no attribute 'groups'